ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/esb_setPromotionalSaleListings_optional.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.ebay.setPromotionalSaleListings">
	<soapenv:Header></soapenv:Header>
	<soapenv:Body>
		<urn:apiUrl>%s(tradingApiUrl)</urn:apiUrl>
		<urn:appId>%s(appId)</urn:appId>
		<urn:version>%s(version)</urn:version>
		<urn:routing>%s(routing)</urn:routing>
		<urn:siteId>%s(siteId)</urn:siteId>
		<urn:authToken>%s(authToken)</urn:authToken>
		<urn:action>Add</urn:action>
		<urn:promotionalSaleID>%s(promotionalSaleId)</urn:promotionalSaleID>
		<urn:allFixedPriceItems>true</urn:allFixedPriceItems>
		<!-- Send Connector method name to be called -->
		<urn:method>setPromotionalSaleListings</urn:method>
	</soapenv:Body>
</soapenv:Envelope>
